## Aggregate, Scalar, String, Date and Time Functions

In [1]:
%load_ext sql
%sql ibm_db_sa://mpc82210:7rf3d7vvlfj%5Egf7d@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB

In [3]:
%sql SELECT * FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (2, 'Dog', 3, Decimal('666.66'), datetime.date(2018, 6, 1)),
 (3, 'Dog', 1, Decimal('100.00'), datetime.date(2018, 6, 4)),
 (4, 'Parrot', 2, Decimal('50.00'), datetime.date(2018, 6, 4)),
 (5, 'Dog', 1, Decimal('75.75'), datetime.date(2018, 6, 10)),
 (6, 'Hamster', 6, Decimal('60.60'), datetime.date(2018, 6, 11)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

#### Aggregate Functions

In [4]:
%sql SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1718.24'),)]

In [15]:
%sql SELECT MAX(QUANTITY) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(24,)]

In [16]:
%sql SELECT AVG(COST) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('190.915555555555555555555555555'),)]

In [20]:
%sql SELECT AVG(COST/QUANTITY) FROM PETRESCUE WHERE ANIMAL = 'Dog'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('127.270000000000000000000000000'),)]

#### Scalar and Tring Functions

In [21]:
%sql SELECT ROUND(COST) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('450.00'),),
 (Decimal('667.00'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('76.00'),),
 (Decimal('61.00'),),
 (Decimal('44.00'),),
 (Decimal('48.00'),),
 (Decimal('222.00'),)]

In [22]:
%sql SELECT LENGTH(ANIMAL) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

In [23]:
%sql SELECT UCASE(ANIMAL) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

In [25]:
%sql SELECT DISTINCT(UCASE(ANIMAL)) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('CAT',), ('DOG',), ('GOLDFISH',), ('HAMSTER',), ('PARROT',)]

In [29]:
%sql SELECT * FROM PETRESCUE WHERE LCASE(ANIMAL) = 'cat'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11))]

#### Date and Time Functions

In [30]:
%sql SELECT DAY(RESCUEDATE) FROM PETRESCUE WHERE ANIMAL = 'Cat'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(29,), (11,)]

In [34]:
%sql SELECT COUNT(*) AS RESCUE_COUNT FROM PETRESCUE WHERE MONTH(RESCUEDATE) = '05'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1'),)]

In [35]:
%sql SELECT (RESCUEDATE + 3 DAYS) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 4),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 13),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 17),),
 (datetime.date(2018, 6, 18),)]

In [36]:
%sql SELECT (CURRENT_DATE - RESCUEDATE) AS HOW_LONG FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('20521'),),
 (Decimal('20518'),),
 (Decimal('20515'),),
 (Decimal('20515'),),
 (Decimal('20509'),),
 (Decimal('20508'),),
 (Decimal('20508'),),
 (Decimal('20505'),),
 (Decimal('20504'),)]